Show / Hide Table of Contents
Class MaterialBoltGrade
Material bolt grade
Inheritance
System.Object
OpenObject
OpenElementId
Material
MaterialBoltGrade
MaterialBoltGradeHKG
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.MaterialBoltGrade,CI.Material", "CI.StructModel.Libraries.Material.IMatBoltGrade,CI.BasicTypes", typeof(Material))]
public class MaterialBoltGrade : Material
Properties
Improve this Doc   View Source
Code
Design code
Declaration
public CountryCode Code { get; set; }
Property Value
 Type |  Description
 CountryCode
Improve this Doc   View Source
Elongation
Elongation after fracture - for 20% elongation use value 0.2
Declaration
public double Elongation { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
fub
Ultimate tensile strength
Declaration
public double fub { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
fyb
Yield strength
Declaration
public double fyb { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MprlElementID
Name fo the bolt grade in MPRL database
Declaration
public Guid MprlElementID { get; set; }
Property Value
 Type |  Description
 System.Guid
Improve this Doc   View Source
MprlTableID
Unique ID of MPRL database table where the bolt grade was taken from.
Declaration
public Guid MprlTableID { get; set; }
Property Value
 Type |  Description
 System.Guid
 Improve this Doc
 View Source